import { getToken, setToken, removeToken } from '@/utils/auth'
import { Message } from 'element-ui';

export default {
    state: {
        //项目信息
        projectType: ["地铁勘察类", "房建勘察类", "市政勘察类", "规划勘察类", "桥梁勘察类", "水运勘察类", "机场勘察类", "公路勘察类", "铁路勘察类",],
        exploreStage: ["工可勘察", "初勘阶段", "详勘阶段", "补充勘察", "施工勘察",],
        exploreLevel: ["甲级", "乙级", "丙级"],

        //勘探点信息
        holeNatures: ["一般性钻孔", "控制性钻孔"],
        holeTypes: ["鉴别孔",
            "取土试样钻孔",
            "取水试样钻孔",
            "标准贯入试验孔",
            "圆锥动力触探试验孔",
            "十字板剪切试验孔",
            "波速试验孔",
            "旁压试验孔",
            "电阻率测试孔",
            "地温测试孔",
            "物探点",
            "取土、取水试样钻孔",
            "取土标贯钻孔",
            "取土、取水标贯钻孔",
            "抽水试验"
        ],
        holePlaceTypes: [
            "㮇梁",
            "隧道",
            "深路堑",
            "高路堤",
            "陡坡路堤",
            '不良地质',
            '特殊性岩土',
            '一般路基',
            '支挡工程',
            '河岸堤防工程',
            '改河工程',
            '涵洞',
            '取土场',
            '房建及其它',
        ],

    },

    mutations: {

    },

    actions: {

    }
}
